Documents/СчетНаОплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СчетНаОплату</Name>
			<Comment>Счет на оплату</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЕдиницыИзмерений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СчетНаОплату/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать
// Заполняет список команд печати.
// 
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//Счет на оплату
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.СчетНаОплату";
    КомандаПечати.Идентификатор = "СчетНаОплату";
    КомандаПечати.Представление = НСтр("ru = 'Счет на оплату'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Счет на оплату'");
	КомандаПечати.Порядок        = 10;
	
	// Счет на оплату (с печатью и подписями) 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.СчетНаОплату";
	КомандаПечати.Идентификатор  = "СчетНаОплатуСПечатью";
	КомандаПечати.Представление  = НСтр("ru = 'Счет на оплату (с печатью и подписями) '");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина; 
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Счет на оплату'");
	КомандаПечати.Порядок        = 20;

	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
// МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
// ПараметрыПечати – Структура – дополнительные настройки печати;
// КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
// ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
// представление – имя области, в которой был выведен объект (выходной параметр);
// ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплату") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "СчетНаОплату",
        НСтр("ru = 'Счет на оплату'"),
        ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, Ложь),
        ,
        "Документ.СчетНаОплату.ПФ_MXL_СчетНаОплату");
    ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуСПечатью") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        КоллекцияПечатныхФорм,
        "СчетНаОплатуСПечатью",
        НСтр("ru = 'Счет на оплату (с печатью и подписями)'"),
        ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, Истина),
        ,
        "Документ.СчетНаОплату.ПФ_MXL_СчетНаОплату");

    КонецЕсли;

КонецПроцедуры

Функция ПолучитьДанныеДляПечатныхФорм(МассивОбъектов) Экспорт
    
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК ДатаДокумента,
	|	""01.01.0001"" КАК Дата,
	|	ДанныеДокумента.Валюта КАК Валюта,
	|	ДанныеДокумента.ВидЦен КАК ВидЦен,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Организация.ПолноеНаименование = """"
	|			ТОГДА ДанныеДокумента.Организация.ПолноеНаименование
	|		ИНАЧЕ ДанныеДокумента.Организация.Наименование
	|	КОНЕЦ КАК ПредставлениеОрганизации,
	|	ДанныеДокумента.БанковскийСчет КАК БанковскийСчет,
	|	ДанныеДокумента.БанковскийСчет.НомерСчета КАК БанковскийСчетНомерСчета,
	|	ДанныеДокумента.БанковскийСчет.БИК КАК БанковскийСчетБИК,
	|	ДанныеДокумента.БанковскийСчет.КоррСчет КАК БанковскийСчетКоррСчет,
	|	ДанныеДокумента.БанковскийСчет.НаименованиеБанка КАК БанковскийСчетНаименованиеБанка,
	|	"""" КАК ИнтернетОплатаСсылка,
	|	"""" КАК ИнтернетОплатаНомерТелефонаПлательщика,
	|	"""" КАК ИнтернетОплатаЭлектроннаяПочтаПлательщика,
	|	ДанныеДокумента.Организация.ИНН КАК ИНН,
	|	ДанныеДокумента.Организация.КПП КАК КПП,
	|	ДанныеДокумента.Организация.Руководитель КАК ОрганизацияРуководитель,
	|	ДанныеДокумента.Организация.ГлавныйБухгалтер КАК ОрганизацияГлавныйБухгалтер,
	|	ДанныеДокумента.Организация.ПолноеНаименование КАК ОрганизацияПолноеНаименование,
	|	ДанныеДокумента.Организация.ЯвляетсяПлательщикомНДС КАК ОрганизацияЯвляетсяПлательщикомНДС,
	|	ДанныеДокумента.Контрагент КАК Контрагент,
	|	ДанныеДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК ПредставлениеКонтрагента,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеДокумента.Контрагент.НаименованиеПолное = """"
	|			ТОГДА ДанныеДокумента.Контрагент.НаименованиеПолное
	|		ИНАЧЕ ДанныеДокумента.Контрагент.Наименование
	|	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	|	ДанныеДокумента.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Автор КАК Автор,
	|	ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
	|	""текст расшифровки НДС"" КАК НДС,
	|	0 КАК ИтогоСуммаНДС,
	|	0 КАК ИтогоСуммаБезНДС,
	|	0 КАК СуммаРучнойСкидки,
	|	0 КАК Скидка,
	|	0 КАК ИтогоВес,
	|	0 КАК Вес,
	|	0 КАК Сумма,
	|	0 КАК КолвоПозиций
	|ИЗ
	|	Документ.СчетНаОплату КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Номенклатура.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки КАК Скидка,
	|	ДанныеДокумента.Сумма + ДанныеДокумента.СуммаРучнойСкидки КАК СуммаБезСкидки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерений)
	|			ТОГДА ДанныеДокумента.ЕдиницаИзмерения.Вес
	|		ИНАЧЕ ДанныеДокумента.Номенклатура.Вес
	|	КОНЕЦ КАК Вес,
	|	ДанныеДокумента.Потолок КАК Потолок,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.СчетНаОплату.Товары КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка,
	|	1000 + ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Номенклатура.Артикул,
	|	ДанныеДокумента.Номенклатура,
	//|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ДанныеДокумента.ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ДанныеДокумента.ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент,
	|	ДанныеДокумента.Количество,
	|	ДанныеДокумента.Цена,
	|	ДанныеДокумента.Сумма,
	|	ДанныеДокумента.ПроцентРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки,
	|	ДанныеДокумента.Сумма + ДанныеДокумента.СуммаРучнойСкидки,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДанныеДокумента.ЕдиницаИзмерения) = ТИП(Справочник.ЕдиницыИзмерений)
	|			ТОГДА ДанныеДокумента.ЕдиницаИзмерения.Вес * ДанныеДокумента.Количество
	|		ИНАЧЕ ДанныеДокумента.Номенклатура.Вес * ДанныеДокумента.Количество
	|	КОНЕЦ,
	|	ДанныеДокумента.Потолок,
	|	ДанныеДокумента.СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС
	|ИЗ
	|	Документ.СчетНаОплату.Услуги КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Артикул КАК Артикул,
	|	ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ДанныеДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеДокумента.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ДанныеДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеДокумента.Коэффициент КАК Коэффициент,
	|	ДанныеДокумента.Количество КАК Количество,
	|	ДанныеДокумента.Цена КАК Цена,
	|	ДанныеДокумента.Сумма КАК Сумма,
	|	ДанныеДокумента.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ДанныеДокумента.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ДанныеДокумента.Скидка КАК Скидка,
	|	ДанныеДокумента.СуммаБезСкидки КАК СуммаБезСкидки,
	|	ДанныеДокумента.Вес КАК Вес,
	|	ДанныеДокумента.Потолок КАК Потолок,
	|	ДанныеДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	ВТ_Товары КАК ДанныеДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Ссылка,
	|	ДанныеДокумента.НомерСтроки
	|ИТОГИ
	|	КОЛИЧЕСТВО(НомерСтроки),
	|	СУММА(Сумма),
	|	СУММА(СуммаРучнойСкидки),
	|	СУММА(Вес),
	|	СУММА(СуммаНДС)
	|ПО
	|	Ссылка";

	МассивРезультатов         = Запрос.ВыполнитьПакет();
	РезультатПоШапке          = МассивРезультатов[0];
	РезультатПоТабличнойЧастиТовары = МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧастиТовары",
	                                               РезультатПоШапке, РезультатПоТабличнойЧастиТовары);
	
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции

Процедура ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса, ВыборкаПоТоварам=Неопределено) Экспорт
	
	ОбщийМодульСервер.ДобавитьКолонкиКонтактнойИнформации(РезультатЗапроса);
	
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		
		ТекущаяСтрока.Дата = Формат(ТекущаяСтрока.ДатаДокумента, "ДЛФ=Д");		
		Попытка
			ТекущаяСтрока.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ТекущаяСтрока.Номер);
		Исключение
		КонецПопытки;
		
		Если НЕ ВыборкаПоТоварам = Неопределено Тогда
			СтруктураПоиска = Новый Структура("Ссылка", ТекущаяСтрока.Ссылка);
			ВыборкаПоТоварам.Сбросить();
			Если ВыборкаПоТоварам.НайтиСледующий(СтруктураПоиска) Тогда
				ТекущаяСтрока.СуммаРучнойСкидки = ВыборкаПоТоварам.СуммаРучнойСкидки;
				ТекущаяСтрока.Скидка = ВыборкаПоТоварам.СуммаРучнойСкидки;
				ТекущаяСтрока.ИтогоВес = ВыборкаПоТоварам.Вес;
				ТекущаяСтрока.Вес = ВыборкаПоТоварам.Вес;
				ТекущаяСтрока.ИтогоСуммаНДС = ВыборкаПоТоварам.СуммаНДС;
				ТекущаяСтрока.ИтогоСуммаБезНДС = ВыборкаПоТоварам.Сумма - ВыборкаПоТоварам.СуммаНДС;
				ТекущаяСтрока.Сумма = ВыборкаПоТоварам.Сумма;	
				ТекущаяСтрока.КолвоПозиций = ВыборкаПоТоварам.НомерСтроки;
			КонецЕсли;						
		КонецЕсли;
		
		Если ТекущаяСтрока.ИтогоСуммаНДС = 0 Тогда			
			ТекущаяСтрока.НДС = "Без налога (НДС)";		
		Иначе			
			ТекущаяСтрока.НДС = "В том числе НДС:";	
		КонецЕсли;
		
		ОбщийМодульСервер.ДополнитьДанныеДляПечатныхФормКонтактнойИнформацией(ТекущаяСтрока, ТекущаяСтрока.Организация, ТекущаяСтрока.Контрагент);
	КонецЦикла;		
	
КонецПроцедуры

Функция ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, СПечатью)
	
	Возврат ОбщийМодульСервер.ПечатьСчетНаОплату(МассивОбъектов, ОбъектыПечати, СПечатью);
	
	//// Создаем табличный документ и устанавливаем имя параметров печати.
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати 	= "ПараметрыПечати_СчетНаОплату";
	//ТабличныйДокумент.АвтоМасштаб			= Истина;
	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплату.ПФ_MXL_СчетНаОплату");
	//ВыводитьАртикул = Константы.ВыводитьАртикулНоменклатурыВПечатныхФормах.Получить();
	//
	//// Получаем запросом необходимые данные.
	//РезультатЗапроса = ПолучитьДанныеДляПечатныхФорм(МассивОбъектов);
	//ДополнитьДанныеДляПечатныхФорм(РезультатЗапроса);	
	//
	//ПервыйДокумент = Истина;
	//Для Каждого Шапка Из РезультатЗапроса Цикл
	//    Если Не ПервыйДокумент Тогда
	//        // Все документы нужно выводить на разных страницах.
	//        ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//    КонецЕсли;
	//    ПервыйДокумент = Ложь;
	//    // Запомним номер строки, с которой начали выводить текущий документ.
	//    НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	//	
	//	//ЕстьСекция_СтрокаТабличнойЧастиТовары = Ложь;
	//	//ЕстьСекция_СтрокаТабличнойЧастиПредставители = Ложь;
	//	//ЕстьСекция_СтрокаТабличнойЧастиГрафикПлатежей = Ложь;
	//	
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Заглавие");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		
	//		ДвоичныеДанныеПодписи = Шапка.Организация.ФайлЛоготип.Файл.Получить();
	//		Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
	//			ОбластьМакета.Рисунки.Логотип.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
	//		КонецЕсли;	
	//		
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	Попытка
	//		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	
	//	//НАЧАЛО Хаматов А.Р. 2017-07-18
	//	// подготовим табличную часть в зависимости от варианта формирования ПФ счета на оплату
	//	ВариантФормированияПФСчетаНаОплату = Константы.ВариантФормированияПФСчетаНаОплату.Получить();
	//	ТаблицаТоварыИУслуги = Шапка.Товары.Скопировать();
	//	ТаблицаТоварыИУслуги.Колонки.Добавить("ВидНоменклатуры");
	//	ТаблицаТоварыИУслуги.Колонки.Добавить("ЕстьПотолок");
	//	
	//	Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
	//		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда
	//			ТекущаяСтрока.ВидНоменклатуры = 1;
	//			ТекущаяСтрока.Потолок = ТекущаяСтрока.Номенклатура;
	//		Иначе
	//			ТекущаяСтрока.ВидНоменклатуры = 2;
	//		КонецЕсли;
	//		Если ТекущаяСтрока.Потолок.Пустая() Тогда
	//			ТекущаяСтрока.ЕстьПотолок = 2;
	//		Иначе
	//			ТекущаяСтрока.ЕстьПотолок = 1;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Для Каждого ТекущаяСтрока Из Шапка.Услуги Цикл
	//		НоваяСтрока = ТаблицаТоварыИУслуги.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	//		НоваяСтрока.ВидНоменклатуры = 3;
	//		Если ТекущаяСтрока.Потолок.Пустая() Тогда
	//			НоваяСтрока.ЕстьПотолок = 2;
	//		Иначе
	//			НоваяСтрока.ЕстьПотолок = 1;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	//0. Потолок - товар - услуга - потолок - товар - услуга
	//	//1. Потолок, Потолок, Товары, Товары, услуги, услуги
	//	//2. Потолок - потолок - товар (все одинаковые позиции сворачиваются). - услуга (все одинаковые позиции сворачиваются) 
	//	//3. Без группировок
	//	Если ВариантФормированияПФСчетаНаОплату = 0 Тогда
	//		ТаблицаТоварыИУслуги.Сортировать("ЕстьПотолок, Потолок, ВидНоменклатуры");		
	//	ИначеЕсли ВариантФормированияПФСчетаНаОплату = 1 Тогда
	//		ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры");
	//	ИначеЕсли ВариантФормированияПФСчетаНаОплату = 2 Тогда
	//		ТаблицаТоварыИУслуги.Свернуть("Артикул, Номенклатура, ЕдиницаИзмерения, Коэффициент, Цена, ПроцентРучнойСкидки, Скидка, ВидНоменклатуры, ХарактеристикаНоменклатуры", "Количество, Сумма, СуммаБезСкидки");
	//		ТаблицаТоварыИУслуги.Сортировать("ВидНоменклатуры")
	//	ИначеЕсли ВариантФормированияПФСчетаНаОплату = 3 Тогда
	//		//не сортируем
	//	КонецЕсли;
	//	//КОНЕЦ Хаматов А.Р. 2017-07-18
	//	
	//	//Вычислим есть ли скидки, наценки нас не интересуют
	//	ЕстьСкидки = Ложь;
	//	Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
	//		Если ТекущаяСтрока.Сумма < ТекущаяСтрока.СуммаБезСкидки Тогда
	//			ЕстьСкидки = Истина;
	//			Прервать; //Дальше идти нет смысла
	//		КонецЕсли;	
	//	КонецЦикла;
	//	
	//	Если НЕ ЕстьСкидки Тогда
	//		//без скидки
	//		// уменьшим 
	//		Макет.Область("Товар").ШиринаКолонки = Макет.Область("Товар").ШиринаКолонки + 24;
	//		Макет.Область("Сумма").ШиринаКолонки = 4;
	//		//КОНЕЦ Хаматов А.Р. 2017-05-12		
	//	КонецЕсли;
	//	
	//	// увеличим колонку товар, если не выводим артикул
	//	Если НЕ ВыводитьАртикул Тогда
	//		Макет.Область("Товар").ШиринаКолонки = Макет.Область("Товар").ШиринаКолонки + 8;
	//	КонецЕсли;

	//	Попытка
	//		
	//		ОбластьМакета = ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|НомерСтроки"), Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки"));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|Артикул"), Макет.ПолучитьОбласть("ШапкаТаблицы|Артикул"));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|Данные"), Макет.ПолучитьОбласть("ШапкаТаблицы|Данные"));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		
	//		ОбластьМакета = ?(ЕстьСкидки, Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|Сумма"), Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма"));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		
	//	Исключение
	//	КонецПопытки;
	//	
	//	НомерСтроки = 1;
	//	Попытка
	//		Для Каждого ТекущаяСтрока Из ТаблицаТоварыИУслуги Цикл
	//			
	//			ОбластьМакета = ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|НомерСтроки"), Макет.ПолучитьОбласть("Строка|НомерСтроки"));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
	//			ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//			
	//			Если ВыводитьАртикул Тогда
	//				ОбластьМакета = ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|Артикул"), Макет.ПолучитьОбласть("Строка|Артикул"));
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
	//				ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			КонецЕсли;	
	//			
	//			ОбластьМакета = ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|Данные"), Макет.ПолучитьОбласть("Строка|Данные"));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
	//			ПредставлениеНоменклатуры = Строка(ТекущаяСтрока.Номенклатура) + Строка(УправлениеПечатью.ПредставлениеХарактеристики(ТекущаяСтрока.ХарактеристикаНоменклатуры));
	//			ОбластьМакета.Параметры.ПредставлениеНоменклатуры = ПредставлениеНоменклатуры;
	//			//Наценки не отражаем в ПФ
	//			Если ТекущаяСтрока.СуммаБезСкидки < ТекущаяСтрока.Сумма Тогда						
	//				ОбластьМакета.Параметры.Цена = Окр(ТекущаяСтрока.Сумма / ?(ТекущаяСтрока.Количество > 0, ТекущаяСтрока.Количество, 1), 2);
	//			КонецЕсли;
	//			
	//			Если ВариантФормированияПФСчетаНаОплату = 0 И ТекущаяСтрока.ВидНоменклатуры = 1 Тогда
	//				ОбластьМакета.ТекущаяОбласть = ОбластьМакета.Область(1,1,1,1);
	//				ШрифтПотолка = Новый Шрифт (ОбластьМакета.ТекущаяОбласть.Шрифт,,,Истина);
	//				ОбластьМакета.ТекущаяОбласть.Шрифт = ШрифтПотолка;
	//			КонецЕсли;
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			
	//			ОбластьМакета = ?(ЕстьСкидки, Макет.ПолучитьОбласть("СтрокаСоСкидкой|Сумма"), Макет.ПолучитьОбласть("Строка|Сумма"));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
	//						
	//			Если ТекущаяСтрока.СуммаБезСкидки < ТекущаяСтрока.Сумма И ЕстьСкидки Тогда
	//				ОбластьМакета.Параметры.СуммаБезСкидки = ТекущаяСтрока.Сумма;
	//				ОбластьМакета.Параметры.Скидка = 0;
	//			КонецЕсли;
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//			
	//			НомерСтроки = НомерСтроки + 1;
	//		КонецЦикла;
	//	Исключение
	//	КонецПопытки;
	//		
	//	//подвал
	//	Попытка
	//		ОбластьМакета = ?(Шапка.ОрганизацияЯвляетсяПлательщикомНДС, Макет.ПолучитьОбласть("ИтогоКОплатеНДС|НомерСтроки"), Макет.ПолучитьОбласть("ИтогоКОплате|НомерСтроки"));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//		
	//		Если ВыводитьАртикул Тогда
	//			ОбластьМакета = ?(Шапка.ОрганизацияЯвляетсяПлательщикомНДС, Макет.ПолучитьОбласть("ИтогоКОплатеНДС|Артикул"), Макет.ПолучитьОбласть("ИтогоКОплате|Артикул"));
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		КонецЕсли;
	//		
	//		ОбластьМакета = ?(Шапка.ОрганизацияЯвляетсяПлательщикомНДС, Макет.ПолучитьОбласть("ИтогоКОплатеНДС|Данные"), Макет.ПолучитьОбласть("ИтогоКОплате|Данные"));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ТабличныйДокумент.Присоединить(ОбластьМакета);
	//		
	//		ОбластьМакета = ?(Шапка.ОрганизацияЯвляетсяПлательщикомНДС, Макет.ПолучитьОбласть("ИтогоКОплатеНДС|Сумма"), Макет.ПолучитьОбласть("ИтогоКОплате|Сумма"));
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		Попытка
	//			Если Шапка.ОрганизацияЯвляетсяПлательщикомНДС И Шапка.ИтогоСуммаНДС = 0 Тогда			
	//				ОбластьМакета.Параметры.ИтогоСуммаНДС = "-";
	//			КонецЕсли;
	//		Исключение
	//		КонецПопытки;
	//		ТабличныйДокумент.Присоединить(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//
	//	Попытка 
	//		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВсегоИПрописью");
	//		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//		ОбластьМакета.Параметры.КолвоПозиций = НомерСтроки - 1;
	//		ОбластьМакета.Параметры.СуммаДокументаПрописью = 
	//				РаботаСВалютой.СформироватьЧислоПрописьюВсп(Шапка.СуммаДокумента, Шапка.Валюта, "Л=ru_RU;ДП=Ложь");
	//		ТабличныйДокумент.Вывести(ОбластьМакета);
	//	Исключение
	//	КонецПопытки;
	//	Если НЕ СПечатью Тогда
	//		Попытка 
	//			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
	//			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//			ТабличныйДокумент.Вывести(ОбластьМакета);
	//		Исключение
	//		КонецПопытки;
	//	Иначе
	//		//НАЧАЛО Хаматов А.Р. 2017-05-15
	//		Попытка 
	//			Если Макет.Области.Найти("ПодвалСчетаСПечатью") <> Неопределено Тогда
	//				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчетаСПечатью");
	//				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Шапка);
	//				
	//				ДвоичныеДанныеПодписи = Шапка.Организация.ФайлПечать.Файл.Получить();
	//				Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
	//					ОбластьМакета.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
	//				КонецЕсли;	
	//				ДвоичныеДанныеПодписи = Шапка.Организация.ФайлПодписьРуководителя.Файл.Получить();
	//				Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
	//					ОбластьМакета.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
	//				КонецЕсли;
	//				ДвоичныеДанныеПодписи = Шапка.Организация.ФайлПодписьГлавногоБухгалтера.Файл.Получить();
	//				Если ЗначениеЗаполнено(ДвоичныеДанныеПодписи) Тогда
	//					ОбластьМакета.Рисунки.ПодписьГлавногоБухгалтера.Картинка = Новый Картинка(ДвоичныеДанныеПодписи);
	//				КонецЕсли;
	//			
	//				ТабличныйДокумент.Вывести(ОбластьМакета);				
	//			КонецЕсли;	
	//		Исключение
	//		КонецПопытки;
	//		//КОНЕЦ Хаматов А.Р. 2017-05-15
	//	КонецЕсли;
	//	
	//    // В табличном документе необходимо задать имя области, в которую был 
	//    // выведен объект. Нужно для возможности печати комплектов документов.
	//    УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
	//        НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	//КонецЦикла;
	//Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция ПолучитьМассивРеквизитовПоЦенам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыЦена");
	МассивИменЭлементов.Добавить("ТоварыСумма");
	
	МассивИменЭлементов.Добавить("УслугиЦена");
	МассивИменЭлементов.Добавить("УслугиСумма");
	
	Возврат МассивИменЭлементов;
	
КонецФункции
	
Функция ПолучитьМассивРеквизитовПоСкидкам() Экспорт
	
	МассивИменЭлементов = Новый Массив;
	
	МассивИменЭлементов.Добавить("ТоварыПроцентРучнойСкидки");
	МассивИменЭлементов.Добавить("ТоварыСуммаРучнойСкидки");
	
	МассивИменЭлементов.Добавить("УслугиПроцентРучнойСкидки");
	МассивИменЭлементов.Добавить("УслугиСуммаРучнойСкидки");
	
	Возврат МассивИменЭлементов;
	
КонецФункции

#КонецОбласти

#Область СозданиеНаОсновании

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ИспользоватьЗаявкиНаРасходованиеДенежныхСредств = ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств");
	
	Если ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		Документы.ЗаявкаНаРасходованиеДенежныхСредств.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
	
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	Документы.ОплатаБанковскойКартой.ДобавитьКомандуСоздатьНаОснованииОплатаКредитомМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Документы.ПлатежноеПоручениеИсходящее.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
	Документы.ПриходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании);
	
	Если Не ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
		
		Документы.РасходныйКассовыйОрдер.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
		Документы.СписаниеСРасчетногоСчета.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команду создания документа "Счет на оплату".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОснованииМножественныйВыбор(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.СчетНаОплату) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Обработчик = "СозданиеНаОснованииПотолкиКлиент.СчетНаОплатуСоздатьНаОснованииМножественныйВыбор";
		КомандаСоздатьНаОсновании.Представление = Метаданные.Документы.СчетНаОплату.Представление();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.МножественныйВыбор = Истина;
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли
